var names= [ '---','उक्ता','अत्युक्ता', 'मध्या',	'प्रतिष्ठा','सुप्रतिष्ठा','गायत्री ', 'उष्णिक्', 'अनुष्टुप्', 'बृहती', 'पङ्क्ति', 'त्रिष्टुप्','जगती', 'अतिजगती', 'शक्वरी', 'अतिशक्वरी', 'अष्टि', 'अत्यष्टि', 'धृति', 'अतिधृति', 'कृति','प्रकृति', 'आकृति', 'विकृति', 'संकृति', 'अभिकृति', 'उत्कृति'];
var t = ["कृ","खृ","गृ","घृ","ङृ","चृ","छृ","जृ","झृ","ञृ","टृ","ठृ","डृ","ढृ","णृ","तृ","थृ","दृ","धृ","नृ","पृ","फृ","बृ","भृ","मृ","यृ","रृ","लृ","वृ","शृ","षृ","सृ","हृ","कॢ","गॢ","घॢ","ङॢ","चॢ","छॢ","जॢ","झॢ","ञॢ","टॢ","ठॢ","डॢ","ढॢ","णॢ","तॢ","थॢ","दॢ","धॢ","नॢ","पॢ","फॢ","बॢ","भॢ","मॢ","यॢ","रॢ","लॢ","वॢ","शॢ","षॢ","सॢ","हॢ","कि","कु","खि","खु","गि","गु","घि","घु","ङि","ङु","चि","चु","छि","छु","जि","जु","झि","झु","ञि","ञु","टि","टु","ठि","ठु","डि","डु","ढि","ढु","णि","णु","ति","तु","थि","थु","दि","दु","धि","धु","नि","नु","पि","पु","फि","फु","बि","बु","भि","भु","मि","मु","यि","यु","रि","रु","लि","लु","वि","वु","शि","शु","षि","षु","सि","सु","हि","हु","अ","इ","उ","ऋ","ऌ","क","ख","ग","घ","ङ","च","छ","ज","झ","ञ","ट","ठ","ड","ढ","ण","त","थ","द","ध","न","प","फ","ब","भ","म","य","र","ल","व","श","ष","स","ह"];
var k = ["ः","क्","ख्","ग्","घ्","ङ्","च्","छ्","ज्","झ्","ञ्","ट्","ठ्","ड्","ढ्","ण्","त्","थ्","द्","ध्","न्","प्","फ्","ब्","भ्","म्","य्","र्","ल्","व्","श्","ष्","स्","ह्"];
function lagabodhakam(){
var x = document.getElementById("inp").value;

var varnamala = [""," ","अ","आ","इ","इ","उ","ऊ","ऋ","ॠ","ऌ","ॡ","ए","ऐ","ओ","औ","्","ः","ं","ँ","ऽ","ा","ि","ी","ु","ू","ृ","ॄ","ॢ","ॣ","े","े","ै","ो","ौ","क","ख","ग","घ","ङ","च","छ","ज","झ","ञ","ट","ठ","ड","ढ","ण","त","थ","द","ध","न","प","फ","ब","भ","म","य","र","र","ल","व","श","ष","स","ह","क्","ख्","ग्","घ्","ङ्","च्","छ्","ज्","झ्","ञ्","ट्","ठ्","ड्","ढ्","ण्","त्","थ्","द्","ध्","न्","प्","फ्","ब्","भ्","म्","य्","र्","ल्","व्","श्","ष्","स्","ह्","॑","॒"];
 if(varnamala.includes(x.substr(-1))==false){
    alert("देवनागरलिपिरेव इहानुमतास्ति !");
    document.getElementById("inp").value=x.slice(0, -1);
return;
} 

//ध्रादिपरः
for (var j = 0; j<k.length; j++){
    for(var i=0;i<t.length;i++){
    var yog = t[i]+k[j];
    x=x.replaceAll(yog,"S");}}

//गन्ते
for (var i = 0; i<t.length; i++){
if(x.charAt(x.length-1)== t[i] || x.substr(x.length-2)== t[i]){
x=x.replace(new RegExp(t[i]+'$'),"S");}}    

//हे
x=x.replace(/कृँ|खृँ|गृँ|घृँ|ङृँ|चृँ|छृँ|जृँ|झृँ|ञृँ|टृँ|ठृँ|डृँ|ढृँ|णृँ|तृँ|थृँ|दृँ|धृँ|नृँ|पृँ|फृँ|बृँ|भृँ|मृँ|यृँ|रृँ|लृँ|वृँ|शृँ|षृँ|सृँ|हृँ|कॢँ|गॢँ|घॢँ|ङॢँ|चॢँ|छॢँ|जॢँ|झॢँ|ञॢँ|टॢँ|ठॢँ|डॢँ|ढॢँ|णॢँ|तॢँ|थॢँ|दॢँ|धॢँ|नॢँ|पॢँ|फॢँ|बॢँ|भॢँ|मॢँ|यॢँ|रॢँ|लॢँ|वॢँ|शॢँ|षॢँ|सॢँ|हॢँ|किँ|कुँ|खिँ|खुँ|गिँ|गुँ|घिँ|घुँ|ङिँ|ङुँ|ञिँ|ञुँ|चिँ|चुँ|छिँ|छुँ|जिँ|जुँ|झिँ|झुँ|टिँ|टुँ|ठिँ|ठुँ|डिँ|डुँ|ढिँ|ढुँ|णिँ|णुँ|तिँ|तुँ|थिँ|थुँ|दिँ|दुँ|धिँ|धुँ|निँ|नुँ|पिँ|पुँ|फिँ|फुँ|बिँ|बुँ|भिँ|भुँ|मिँ|मुँ|यिँ|युँ|रिँ|रुँ|लिँ|लुँ|विँ|वुँ|शिँ|शुँ|षिँ|षुँ|सिँ|सुँ|हिँ|हुँ|इँ|उँ|ऋँ|ऌँ|अँ|ङँ|ञँ|णँ|कँ|खँ|गँ|घँ|ङँ|चँ|छँ|जँ|झँ|ञँ|टँ|ठँ|डँ|ढँ|णँ|तँ|थँ|दँ|धँ|नँ|पँ|फँ|बँ|भँ|मँ|यँ|रँ|रँ|लँ|वँ|शँ|षँ|सँ|हँ|कृं|खृं|गृं|घृं|ङृं|चृं|छृं|जृं|झृं|ञृं|टृं|ठृं|डृं|ढृं|णृं|तृं|थृं|दृं|धृं|नृं|पृं|फृं|बृं|भृं|मृं|यृं|रृं|लृं|वृं|शृं|षृं|सृं|हृं|कॢं|गॢं|घॢं|ङॢं|चॢं|छॢं|जॢं|झॢं|ञॢं|टॢं|ठॢं|डॢं|ढॢं|णॢं|तॢं|थॢं|दॢं|धॢं|नॢं|पॢं|फॢं|बॢं|भॢं|मॢं|यॢं|रॢं|लॢं|वॢं|शॢं|षॢं|सॢं|हॢं|किं|कुं|खिं|खुं|गिं|गुं|घिं|घुं|ङिं|ङुं|ञिं|ञुं|चिं|चुं|छिं|छुं|जिं|जुं|झिं|झुं|टिं|टुं|ठिं|ठुं|डिं|डुं|ढिं|ढुं|णिं|णुं|तिं|तुं|थिं|थुं|दिं|दुं|धिं|धुं|निं|नुं|पिं|पुं|फिं|फुं|बिं|बुं|भिं|भुं|मिं|मुं|यिं|युं|रिं|रुं|लिं|लुं|विं|वुं|शिं|शुं|षिं|षुं|सिं|सुं|हिं|हुं|इं|उं|ऋं|ऌं|आ|ई|ऊ|ए|ऐ|ओ|औ|अं|अः|का|की|कू|के|कै|को|कौ|कं|कः|खा|खी|खू|खे|खै|खो|खौ|खं|खः|गा|गी|गू|गे|गै|गो|गौ|गं|गः|घा|घी|घू|घे|घै|घो|घौ|घं|घः|चा|ची|चू|चे|चै|चो|चौ|चं|चः|छा|छी|छू|छे|छै|छो|छौ|छं|छः|जा|जी|जू|जे|जै|जो|जौ|जं|जः|झा|झी|झू|झे|झै|झो|झौ|झं|झः|टा|टी|टू|टे|टै|टो|टौ|टं|टः|ठा|ठी|ठू|ठे|ठै|ठो|ठौ|ठं|ठः|डा|डी|डू|डे|डै|डो|डौ|डं|डः|ढा|ढी|ढू|ढे|ढै|ढो|ढौ|ढं|ढः|णा|णी|णू|णे|णै|णो|णौ|णं|णः|ता|ती|तू|ते|तै|तो|तौ|तं|तः|था|थी|थू|थे|थै|थो|थौ|थं|थः|दा|दी|दू|दे|दै|दो|दौ|दं|दः|धा|धी|धू|धे|धै|धो|धौ|धं|धः|ना|नी|नू|ने|नै|नो|नौ|नं|नः|पा|पी|पू|पे|पै|पो|पौ|पं|पः|फा|फी|फू|फे|फै|फो|फौ|फं|फः|बा|बी|बू|बे|बै|बो|बौ|बं|बः|भा|भी|भू|भे|भै|भो|भौ|भं|भः|मा|मी|मू|मे|मै|मो|मौ|मं|मः|या|यी|यू|ये|यै|यो|यौ|यं|यः|रा|री|रू|रे|रै|रो|रौ|रं|रः|ला|ली|लू|ले|लै|लो|लौ|लं|लः|वा|वी|वू|वे|वै|वो|वौ|वं|वः|शा|शी|शू|शे|शै|शो|शौ|शं|शः|षा|षी|षू|षे|षै|षो|षौ|षं|षः|सा|सी|सू|से|सै|सो|सौ|सं|सः|हा|ही|हू|हे|है|हो|हौ|हं|हः|ञा|ञी|ञू|ञे|ञै|ञो|ञौ|ञं|ञः|ङा|ङी|ङू|ङे|ङै|ङो|ङौ|ङं|ङः|णा|णी|णू|णे|णै|णो|णौ|णं|णः/g,"S");
x=x.replaceAll(/ँ|ं|ः|:|ऽ|क्|ख्|ग्|घ्|ङ्|च्|छ्|ज्|झ्|ञ्|ट्|ठ्|ड्|ढ्|ण्|त्|थ्|द्|ध्|न्|प्|फ्|ब्|भ्|म्|य्|र्|र्|ल्|व्|श्|ष्|स्|ह्/g,"");
//गृ ल्
x=x.replace(/कृ|खृ|गृ|घृ|ङृ|चृ|छृ|जृ|झृ|ञृ|टृ|ठृ|डृ|ढृ|णृ|तृ|थृ|दृ|धृ|नृ|पृ|फृ|बृ|भृ|मृ|यृ|रृ|लृ|वृ|शृ|षृ|सृ|हृ|कॢ|गॢ|घॢ|ङॢ|चॢ|छॢ|जॢ|झॢ|ञॢ|टॢ|ठॢ|डॢ|ढॢ|णॢ|तॢ|थॢ|दॢ|धॢ|नॢ|पॢ|फॢ|बॢ|भॢ|मॢ|यॢ|रॢ|लॢ|वॢ|शॢ|षॢ|सॢ|हॢ|कि|कु|खि|खु|गि|गु|घि|घु|चि|चु|छि|छु|जि|जु|झि|झु|टि|टु|ठि|ठु|डि|डु|ढि|ढु|णि|णु|ति|तु|थि|थु|दि|दु|धि|धु|नि|नु|पि|पु|फि|फु|बि|बु|भि|भु|मि|मु|यि|यु|रि|रु|लि|लु|वि|वु|शि|शु|षि|षु|सि|सु|हि|हु/g,"I");
//गृ ल्
x=x.replace(/अ|इ|उ|ऋ|ऌ|ङ|ञ|ण|क|ख|ग|घ|ङ|च|छ|ज|झ|ञ|ट|ठ|ड|ढ|ण|त|थ|द|ध|न|प|फ|ब|भ|म|य|र|र|ल|व|श|ष|स|ह/g,"I");
x=x.replace(/।|॥|॑|॒/g,"<br>");
x=x.replace(/ |/g,"");
//फलितम्
document.getElementById("falani").innerHTML = x;

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

var n= x.length;
document.getElementById("padaksharani").value=n;
if(n>26){
document.getElementById("chhandasonama").value="एतद्दण्डकं विद्यात् ।"
}else{
document.getElementById("chhandasonama").value=names[n];
}
if(x==""){
document.getElementById("prastarabhedah").value=0;
}else{
document.getElementById("prastarabhedah").value=2**n;}

//Other functions running........
lg();
gan();
}

